# Lecture 7 - Functions, Pandas, Data Cleaning, and Preparation

In this lecture we will talk more about:
    
- Functions in Python
- Pandas Dataframes

## Functions in Python

In [1]:
def doubleNum(nb):
    num=nb*2 
    return num

number = input("Give me a number:")
print("The double is", doubleNum(int(number)))

Give me a number: 3

The double is 6

In [101]:
number = input("Give me a number:")
print("The double is", (lambda x: int(x)*2)(number))

Give me a number: 3

The double is 6

## Pandas

This tutorial has been adapted from the creator of [Pandas, Wes McKinney](https://github.com/wesm/pydata-book).

In [2]:
import numpy as np
import pandas as pd

# Remember to always import pandas

## Data loading

Last time, and in Lab 3, we talked about loading data in Python using pandas.

Let's talk now about how to clean and prepare data using Pandas.

## Handling Missing Data

In [5]:
string_data = pd.DataFrame(['aardvark', 'artichoke', np.nan, 'avocado'])
print(string_data)
string_data.isnull()

           0
0   aardvark
1  artichoke
2        NaN
3    avocado

       0
0  False
1  False
2   True
3  False

In [7]:
string_data[0] = None
print (string_data)
string_data.isnull()

      0
0  None
1  None
2  None
3  None

      0
0  True
1  True
2  True
3  True

### Filtering Out Missing Data

In [17]:
from numpy import nan as NA
data = pd.DataFrame([1, NA, 3.5, NA, 7])
data
#data.dropna()

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [18]:
data[data.notnull()]

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.335918       NaN       NaN
1  1.850358       NaN       NaN
2 -0.750851       NaN -0.096214
3  0.648699       NaN  0.221151
4 -0.135712 -0.190232  0.588507
5  2.135842 -0.979904 -0.492756
6 -0.487722  1.036123  0.144245

In [12]:
df.dropna()

          0         1         2
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

In [13]:
#Keep only the rows with at least 2 non-NA values.
df.dropna(thresh=2)

          0         1         2
2  0.595117       NaN -0.868397
3  1.567890       NaN  2.014625
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

### Filling In Missing Data

In [24]:
df.fillna(0)

          0         1         2
0 -0.335918  0.000000  0.000000
1  1.850358  0.000000  0.000000
2 -0.750851  0.000000 -0.096214
3  0.648699  0.000000  0.221151
4 -0.135712 -0.190232  0.588507
5  2.135842 -0.979904 -0.492756
6 -0.487722  1.036123  0.144245

In [25]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.335918  0.500000  0.000000
1  1.850358  0.500000  0.000000
2 -0.750851  0.500000 -0.096214
3  0.648699  0.500000  0.221151
4 -0.135712 -0.190232  0.588507
5  2.135842 -0.979904 -0.492756
6 -0.487722  1.036123  0.144245

In [26]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.335918  0.000000  0.000000
1  1.850358  0.000000  0.000000
2 -0.750851  0.000000 -0.096214
3  0.648699  0.000000  0.221151
4 -0.135712 -0.190232  0.588507
5  2.135842 -0.979904 -0.492756
6 -0.487722  1.036123  0.144245

In [39]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
#df.fillna(method='ffill') # forward fill with last valid observation (bfill to fill backward)
#df.fillna(method='ffill', limit=2) #number of consecutive NaN values to forward/backward fill

          0         1         2
0 -0.438703  0.506239 -0.508676
1  0.192732  1.179178 -0.444197
2  0.373405       NaN  0.282987
3  0.623921       NaN -0.669441
4  2.358410       NaN       NaN
5 -1.699480       NaN       NaN

In [44]:
data = pd.DataFrame([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) #fills NA with data mean value

          0
0  1.000000
1  3.833333
2  3.500000
3  3.833333
4  7.000000

## Data Transformation

### Removing Duplicates

In [46]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [52]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [54]:
data
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [56]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [61]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [69]:
data['food'].str.lower().map(lambda x: meat_to_animal[x])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [28]:
data = pd.DataFrame([1., -999., 2., -999., -1000., 3.])
data

        0
0     1.0
1  -999.0
2     2.0
3  -999.0
4 -1000.0
5     3.0

In [29]:
data.replace(-999, np.nan)

        0
0     1.0
1     NaN
2     2.0
3     NaN
4 -1000.0
5     3.0

In [30]:
data.replace([-999, -1000], np.nan)

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  NaN
5  3.0

In [31]:
data.replace([-999, -1000], [np.nan, 0])

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  0.0
5  3.0

In [32]:
data.replace({-999: np.nan, -1000: 0})

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  0.0
5  3.0

### Renaming Axis Indexes

In [71]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [75]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [76]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [87]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [81]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [38]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [114]:
ages = [18, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [115]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[NaN, (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], (18.0, 25.0], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [110]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [116]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [117]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[NaN, 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [121]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

array([0.44559072, 0.29236123, 0.68576824, 0.65948455, 0.83356307,
       0.28238572, 0.38605168, 0.52295025, 0.01003307, 0.32474406,
       0.26193831, 0.80537435, 0.1031508 , 0.97818792, 0.66056664,
       0.66830574, 0.14671483, 0.01606407, 0.22092102, 0.25766021])

In [120]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)

(-3.456, -0.652]     250
(-0.652, -0.0345]    250
(-0.0345, 0.732]     250
(0.732, 2.925]       250
dtype: int64

In [124]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
pd.value_counts(cats)

(0.0944, 0.355]                   8
(0.355, 0.808]                    8
(0.009000000000000001, 0.0944]    2
(0.808, 0.978]                    2
dtype: int64

### Detecting and Filtering Outliers

In [126]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003962     0.008188    -0.013702    -0.007832
std       1.047185     0.939210     1.020473     0.992367
min      -3.246760    -3.569068    -3.286367    -3.107337
25%      -0.724034    -0.636408    -0.702900    -0.661900
50%      -0.001683    -0.001956    -0.052691    -0.016640
75%       0.744935     0.644582     0.646220     0.693759
max       3.003760     3.469049     2.927566     3.075938

In [127]:
col = data[2]
col[np.abs(col) > 3]

398   -3.286367
550   -3.116823
Name: 2, dtype: float64

In [134]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
293  0.394520  3.469049 -0.162652 -0.743161
316 -3.220340 -0.307020  1.391752 -0.937555
398 -0.000121  0.155612 -3.286367 -0.985946
424 -0.453425 -3.569068 -0.713986  0.848439
467  0.538905  0.295956  0.373304  3.075938
550  0.313032  0.168938 -3.116823 -1.356531
651 -3.246760  0.570989 -1.000228  0.443644
888  3.003760  1.331034 -1.119213  0.546039
928 -0.298427 -1.987062 -1.606366  3.007034
978  0.140961 -0.551248 -2.086890 -3.107337

In [135]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003499     0.008288    -0.013299    -0.007807
std       1.045783     0.935594     1.019244     0.991782
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.724034    -0.636408    -0.702900    -0.661900
50%      -0.001683    -0.001956    -0.052691    -0.016640
75%       0.744935     0.644582     0.646220     0.693759
max       3.000000     3.000000     2.927566     3.000000

In [136]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0  1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4  1.0 -1.0  1.0  1.0

### Permutation and Random Sampling

In [139]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
#df
sampler = np.random.permutation(5)
sampler

array([2, 3, 4, 1, 0])

In [140]:
df
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [141]:
df.sample(n=3) #selects 3 random rows(default).

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [143]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
2   -1
3    6
2   -1
2   -1
2   -1
0    5
2   -1
3    6
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [150]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
#df
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [151]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## String Manipulation

### String Object Methods

In [152]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [153]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [154]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [155]:
'::'.join(pieces)

'a::b::guido'

In [163]:
'guido' in val
val.index(',')
val.find(':')

-1

In [164]:
val.index(':')

ValueError: substring not found

In [165]:
val.count(',')

2

In [166]:
val.replace(',', '::')
val.replace(',', '')

'ab  guido'

### Regular Expressions

In [169]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)  #All spaces (space, tab, newline...)

['foo', 'bar', 'baz', 'qux']

In [176]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [178]:
regex.findall(text)

['    ', '\t ', '  \t']

In [205]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' #r for raw string

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [207]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [187]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [195]:
print(regex.match(text))

None

In [189]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [210]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [211]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [212]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [213]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [216]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [217]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [218]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [219]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [227]:
data.str.get(1)
#data.str[0]

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [228]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

## Conclusion

In [238]:
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
PREVIOUS_MAX_ROWS
#pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
#np.set_printoptions(precision=4, suppress=True)

ModuleNotFoundError: No module named 'matplotlib'